//======================================================================
//	Stage02(チュートリアルステージ？)
//	
//	概要＿：ステージ02(仮)
//	制作者：
//	
//======================================================================

#ifndef ___STAGE_02_H___
#define ___STAGE_02_H___

//------------------------------
// インクルードファイル
//------------------------------
#include "StageManager.h"
#include <d3d9.h>

//------------------------------
// マクロ定義
//------------------------------


//------------------------------
// クラス定義
//------------------------------
//----シーンタイトル-----
class cStage02 :public cBaseStage{

public:
	void Draw();	//描画
	void Update();	//更新
	cStage02();		//コンストラクタ
	~cStage02();	//デストラクタ
private:
};
#endif //!___STAGE_02_H___