//======================================================================
//	StageManeger
//	
//	概要＿：ステージ管理
//	制作者：加藤 遼
//	
//======================================================================
//-----------------------------
//インクルードファイル
//-----------------------------
#include<stdio.h>
#include<iostream>

#include"StageManager.h"
#include"debugproc.h"
#include"Texture.h"

// 各ステージ
#include "Stage01.h"
#include "Stage02.h"


//-----------------------------
//グローバル
//-----------------------------
cBaseStage* cStageManager::m_pStage = NULL;							//現在のステージの初期化
cStageManager::STAGE cStageManager::m_nCurrentStageNum = STAGE_01;	//現在のステージ番号の初期化


//=======================================================================================
//
//	ステージチェンジ関数
//
//	引数
//	stage インスタンス化したいステージ
//=======================================================================================
void cStageManager::ChangeStage(STAGE stage){

	if (m_pStage != NULL){
		delete m_pStage;	// ステージの解放
		m_pStage = NULL;
	}

	//現在のステージ番号の更新
	SetStageNum(stage);

	switch (stage){

	case STAGE_01:
		m_pStage = new cStage01();
		break;
	case STAGE_02:
		m_pStage = new cStage02();
		break;
	default:
		break;
	}


}

//=======================================================================================
//
//	
//	終了(一応)
//	
//	
//=======================================================================================
void cStageManager::Uninit() {

	if (m_pStage != NULL){
		delete m_pStage;
		m_pStage = NULL;
	}


}

//=======================================================================================
//
//	
//	更新
//	
//	
//=======================================================================================
void cStageManager::Update(){


	if (m_pStage == NULL){
		//なんかメッセージボックス出したほうがいいかな？
	}

	else
		m_pStage->Update();	//現在のシーンの更新関数を呼び出す

	PrintDebugProc("0でステージ切り替え\n");
}

//=======================================================================================
//
//	
//	描画
//	
//	
//=======================================================================================
void cStageManager::Draw(){

	if (m_pStage == NULL){
		//なんかメッセージボックス出したほうがいいかな？
	}

	else
		m_pStage->Draw();	//現在のシーンの描画関数を呼び出す

	//デバッグ用
#ifdef _DEBUG
	PrintDebugProc("ステージ番号:%d\n", m_nCurrentStageNum);
#endif

}

//=======================================================================================
//
//	現在のシーン番号を設定
//
//=======================================================================================
void cStageManager::SetStageNum(STAGE stage){
	m_nCurrentStageNum = stage;
}