//======================================================================
//	Stage01(チュートリアルステージ？)
//	
//	概要＿：ステージ01(仮)
//	制作者：
//	
//======================================================================

#ifndef ___STAGE_01_H___
#define ___STAGE_01_H___

//------------------------------
// インクルードファイル
//------------------------------
#include "StageManager.h"
#include <d3d9.h>

//------------------------------
// マクロ定義
//------------------------------


//------------------------------
// クラス定義
//------------------------------
//----シーンタイトル-----
class cStage01 :public cBaseStage{

public:
	void Draw();	//描画
	void Update();	//更新
	cStage01();		//コンストラクタ
	~cStage01();	//デストラクタ
private:
};
#endif //!___STAGE_01_H___