//======================================================================
//	Star
//	
//	概要＿：星処理
//	制作者：加藤　遼
//	
//======================================================================
//-----------------------------
//インクルードファイル
//-----------------------------
#include <Windows.h>
#include <math.h>
#include "debugproc.h"
#include "Common.h"
#include "Texture.h"

#include "Star.h"


//-----------------------------
//マクロ定義
//-----------------------------
//*************
// 星の初期値
//*************
#define ROUND_TIME	(5)														// 一周するのにかかる時間
#define STAR_SIZE	(D3DXVECTOR2(20.0f,20.0f))								// 星のサイズ
#define STAR_CENTER	(D3DXVECTOR2(SCREEN_WIDTH/2.0f,SCREEN_HEIGHT/2.0f))		// 星の軌道の中心
#define STAR_RADIUS	(D3DXVECTOR2(200.0f,100.0f))							// 軌道半径

//*************
// 恒星関連
//*************
#define FIXED_STAR_SIZE_MAX		(200)		// 恒星の最大サイズ
#define FIXED_STAR_SIZE_RANGE	(60)		// 恒星のサイズの変化幅
#define FIXED_STAR_SIZE_SPEED	(0.4f)		// 恒星のサイズの変化スピード
#define FIXED_STAR_ROTATE_SPEED	(0.01f)		// 恒星の回転スピード


//=======================================================================================
//
//		コンストラクタ
//
//=======================================================================================
cCircleOrbitMovement::cCircleOrbitMovement(){

	// 初期化
	m_center	= D3DXVECTOR2(SCREEN_WIDTH * 0.5f, SCREEN_HEIGHT * 0.5f);	// 円軌道の中心
	m_radius	= D3DXVECTOR2(200.0f, 200.0f);								// 半径
	m_fRad		= 0.0f;														// 角度
	m_fSpeed	= 2 * D3DX_PI / (5 * 60.0f);								// 速さ
}


//=======================================================================================
//
//		デストラクタ
//
//=======================================================================================
cCircleOrbitMovement::~cCircleOrbitMovement(){
}

//=======================================================================================
//
//		Move
//
//=======================================================================================
D3DXVECTOR2 cCircleOrbitMovement::GetMove(){

	// 移動後の座標格納用
	D3DXVECTOR2	pos;

	// 角度更新
	m_fRad += m_fSpeed;

	// 座標更新
	pos.x = m_center.x - m_radius.x*cos(m_fRad);
	pos.y = m_center.y - m_radius.y*sin(m_fRad);

	return pos;
}



//****************************************************************************************************************
// 普通の星
//****************************************************************************************************************
//=======================================================================================
//
//		コンストラクタ
//
//=======================================================================================
cNormalStar::cNormalStar(){

	// Sprite
	m_sprite.SetPos(D3DXVECTOR2(0.0f,0.0f));	
	m_sprite.SetTexture(cTextureManeger::GetTextureGame(TEX_GAME_STAR));
	m_sprite.SetVtxColorA(200);

}	

//=======================================================================================
//
//		デストラクタ
//
//=======================================================================================
cNormalStar::~cNormalStar(){

}
//=======================================================================================
//
//		更新
//
//=======================================================================================
void cNormalStar::Update(){

	// 座標更新
	m_sprite.SetPos(moveCircle.GetMove());

}
//=======================================================================================
//
//		描画
//
//=======================================================================================
void cNormalStar::Draw(){
	m_sprite.Draw();
}

//=======================================================================================
//
//		星の設定
//
//=======================================================================================
void cNormalStar::SetCircleOrbitStar(D3DXVECTOR2 center, D3DXVECTOR2 radius, D3DXVECTOR2 size, int second){

}

//=======================================================================================
//
//		星が見えるか見えないかの設定
//
//=======================================================================================
void cNormalStar::StarVisibility(float distance){

	// α値の変化
	if (distance != 0){
		m_sprite.SetVtxColorA(255 / distance * 20);
	}
	else{
		m_sprite.SetVtxColorA(255);
	}
}

//****************************************************************************************************************
// 恒星
//****************************************************************************************************************
//=======================================================================================
//
//		コンストラクタ
//
//=======================================================================================
cFixedStar::cFixedStar(){

	// Sprite
	m_sprite.SetPos(D3DXVECTOR2(0.0f, 0.0f));	// 座標セット
	m_sprite.SetTexture(cTextureManeger::GetTextureGame(TEX_GAME_STAR_LIGHT));	 // テクスチャのセット
	m_sprite.SetVtxColorA(255);

	m_bSizeSwitch = true;

	// 恒星の色
	//m_sprite.SetVtxColor(D3DXCOLOR(125,0,0,255));

}
//=======================================================================================
//
//		デストラクタ
//
//=======================================================================================
cFixedStar::~cFixedStar(){

}
//=======================================================================================
//
//		更新
//
//=======================================================================================
void cFixedStar::Update(){

	//-------------
	// 円軌道処理
	//-------------
	m_sprite.SetPos(moveCircle.GetMove());

	//-------------
	// 恒星の動き
	//-------------
	if (m_sprite.GetSizeX() >= FIXED_STAR_SIZE_MAX){
		m_bSizeSwitch = true;
	}
	else if (m_sprite.GetSizeX() <= FIXED_STAR_SIZE_MAX - FIXED_STAR_SIZE_RANGE){
		m_bSizeSwitch = false;
	}

	if (m_bSizeSwitch){
		m_sprite.SetSize(D3DXVECTOR2(m_sprite.GetSizeX() - FIXED_STAR_SIZE_SPEED, m_sprite.GetSizeY() - FIXED_STAR_SIZE_SPEED));
		m_sprite.SetVtxColorA(m_sprite.GetVtxColorA() - 0.5f);
		m_sprite.SetRad(m_sprite.GetRad() + FIXED_STAR_ROTATE_SPEED);

	}
	else{
		m_sprite.SetSize(D3DXVECTOR2(m_sprite.GetSizeX() + FIXED_STAR_SIZE_SPEED, m_sprite.GetSizeY() + FIXED_STAR_SIZE_SPEED));
		m_sprite.SetVtxColorA(m_sprite.GetVtxColorA() + 0.5f);
		m_sprite.SetRad(m_sprite.GetRad() - FIXED_STAR_ROTATE_SPEED);

	}
}
//=======================================================================================
//
//		描画
//
//=======================================================================================
void cFixedStar::Draw(){
	m_sprite.Draw();
}

//=======================================================================================
//
//		星の設定
//
//=======================================================================================
void cFixedStar::SetFixedStar(D3DXVECTOR2 center, D3DXVECTOR2 radius, D3DXVECTOR2 size, int second){

}