//======================================================================
//	TitleRogo
//	
//	概要＿：タイトルロゴヘッダ
//	制作者：安藤 光樹
//	
//======================================================================
#ifndef ___TITLEROGO_H___
#define ___TITLEROGO_H___

//-----------------------------
//インクルードファイル
//-----------------------------
#include "Common.h"

//-----------------------------
//マクロ定義
//-----------------------------

//-----------------------------
//列挙型定義
//-----------------------------

//-----------------------------
//クラス定義
//-----------------------------

class cTitleRogo{
private:
	cSpriteParam	m_Rogosprite;			// スプライトのステータス
	cSpriteParam    m_Pushsprite;
//----------------------------------------------------------
protected:

//----------------------------------------------------------
public:
	cTitleRogo();	// コンストラクタ
	~cTitleRogo();	// デストラクタ

	// ここは何かから継承させてもいいかもオーバライド
	void Init();	// 初期化 テクスチャのポインタを受け取って
	void UnInit();	// 終了
	void Update();	// 更新
	void Draw();	// 描画

};

#endif	//!___TITLEROGO_H___