//======================================================================
//	TitleShip.h
//	
//	概要＿：タイトルオブジェクト/船
//	制作者：安藤 光樹
//	
//======================================================================
#ifndef ___TITLESHIP_H___
#define ___TITLESHIP_H___

//-----------------------------
//インクルードファイル
//-----------------------------
#include "Common.h"

//-----------------------------
//マクロ定義
//-----------------------------

//-----------------------------
//列挙型定義
//-----------------------------

//-----------------------------
//クラス定義
//-----------------------------
class cTitleShip
{
private:
	cSpriteParam m_sprite;
	int			 m_nMakeSmokeTime;
	int			 m_nPlaySEFlame;
	bool         m_bShipOutFlag;
//-----------------------------
protected:

//-----------------------------
public:
	cTitleShip();	//コンストラクタ
	~cTitleShip();	//デストラクタ

	void Init();	//初期化処理
	void UnInit();	//終了処理	
	void Update(bool bSceneChangeFlag);	//更新処理
	void Draw();	//描画処理

	bool GetShipOutFlag();	// 船離脱フラグの取得
};

#endif	//!___TITLESHIP_H___