//======================================================================
//	Meteor
//	
//	概要＿：タイトルオブジェクト/流星
//	制作者：安藤 光樹
//	
//======================================================================
#ifndef ___METEOR_H___
#define ___METEOR_H___

//-----------------------------
//インクルードファイル
//-----------------------------
#include "Common.h"

//-----------------------------
//マクロ定義
//-----------------------------
#define MAX_METEOR (3)
#define METEOR_LIFETIME (60)

//-----------------------------
//列挙型定義
//-----------------------------

//-----------------------------
//クラス定義
//-----------------------------
//クラステンプレート
class cMeteor
{
private:	//外部から参照不可
	int m_nMakeTime;	//流星の生成までの時間
	int m_nLifeTime;	//流星の生存時間
	bool m_bUseFlag;	//使用フラグ

	cSpriteParam m_Sprite[3];
	//-----------------------------
protected:	//クラス内でのみ参照可

	//-----------------------------
public:		//どこからでも参照可

	cMeteor();	// コンストラクタ
	~cMeteor();	// デストラクタ

	// ここは何かから継承させてもいいかもオーバライド
	void Init();	// 初期化 テクスチャのポインタを受け取って
	void UnInit();	// 終了
	void Update();	// 更新
	void Draw();	// 描画

	void SetMeteor();	//流星の設定
};

#endif	//!___METEOR_H___