//======================================================================
//	Pause.h
//	
//	概要＿：ポーズシーン
//	制作者：安藤 光樹
//	
//======================================================================
#ifndef ___PAUSE_H___
#define ___PAUSE_H___

//-----------------------------
//インクルードファイル
//-----------------------------
#include "Common.h"

//-----------------------------
//マクロ定義
//-----------------------------

//-----------------------------
//列挙型定義
//-----------------------------

//-----------------------------
//クラス定義
//-----------------------------
class cPause
{
private:
	bool bPauseFlag;				//ポーズシーン使用フラグ
	cSpriteParam cpPauseScreen;	//ポーズシーンスプライト

//-----------------------------
protected:

//-----------------------------
public:

	cPause();			//コンストラクタ
	~cPause();			//デストラクタ
	void Init();	//初期化
	void Uninit();	//終了
	void Update();	//更新
	void Draw();	//描画
	bool GetPauseFlag(void);	//フラグの取得
};
#endif	//!___PAUSE_H___