//======================================================================
//	Enemy
//	
//	概要＿：エネミー(仮)
//	制作者：
//	
//======================================================================
#ifndef ___ENEMY_H___
#define ___ENEMY_H___

//-----------------------------
//インクルードファイル
//-----------------------------
#include "Sprite.h"
#include "Collision.h"

//-----------------------------
//マクロ定義
//-----------------------------

//-----------------------------
//列挙型定義
//-----------------------------

//-----------------------------
//クラス定義
//-----------------------------
class cEnemy{

public:

	// コンストラクタ
	cEnemy(){}
	// デストラクタ
	~cEnemy(){}

	// ここも何かから継承してもいいかもオーバライドさせる形で
	void Init(LPDIRECT3DTEXTURE9* pTex);	// 初期化
	void Unit();	// 終了
	void Update();	// 更新
	void Draw();	// 描画

	cCollider GetCollider(){
		return collider;
	}

private:
	cSpriteParam	sprite;			// スプライトのステータス
	cCollider		collider;		// あたり判定
};

#endif	//!___ENEMY_H___



