//======================================================================
//	Scenegame
//	
//	概要＿：ゲームメイン(仮)
//	制作者：
//	
//======================================================================

//------------------------------
// インクルードファイル
//------------------------------
#include "SceneGame.h"
#include "Sprite.h"
#include "Collision.h"
#include "debugproc.h"
#include "Input.h"

// オブジェクト
#include "Star.h"


//------------------------------
// マクロ定義
//------------------------------
#define TEXTURE_FILNAME_ENEMY ("Image/Character/KingJelly.jpg")
//#define TEXTURE_FILNAME_PLAYER ("Image/Character/Jelly.png")


//-----------------------------
// グローバル
//-----------------------------
// インスタンス用ポインタ
cBaseStar* pCircleOrbitStar;


//=======================================================================================
//
//		初期化
//
//=======================================================================================
cSceneGame::cSceneGame(){


	// テクスチャの読み込み
	LoadTextureFromFile();

	// インスタンス
	pCircleOrbitStar = new cCircleOrbitStar();

	pCircleOrbitStar->Init(&m_pTex[STAR]);

}

//=======================================================================================
//
//		終了
//
//=======================================================================================
cSceneGame::~cSceneGame(){

	pCircleOrbitStar->UnInit();

	// デリーと
	delete pCircleOrbitStar;
}

//=======================================================================================
//
//		更新
//
//=======================================================================================
void cSceneGame::Update(){

	pCircleOrbitStar->Update();


	if (GetKeyboardTrigger(DIK_SPACE)){
		cSceneManeger::ChangeScene(cSceneManeger::TITLE);
	}
}

//=======================================================================================
//
//		描画
//
//=======================================================================================
void cSceneGame::Draw(){

	pCircleOrbitStar->Draw();
}

//=======================================================================================
//
//		このシーンで使うテクスチャの読込
//		ヘッダーのenumとこの関数のchar*配列に追加すればテクスチャがロードされます
//		※ヘッダーのenumとchar配列のファイル名の順番が一致するようにしてください
//		シーンが変わるとテクスチャも消えちゃうのでので同じオブジェクトを別シーンで呼ぶ
//		時はもう一度使うテクスチャを書いてください
//
//=======================================================================================
void cSceneGame::LoadTextureFromFile(){

	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	 // このシーンで使うテクスチャのファイル名
	char* pTexture[MAX_TEXTURE] = {			//※順番注意enumの順にファイル名を書いて
		{ TEXTURE_FILNAME_ENEMY }
	};

	// ロード
	for (int i = 0; i < MAX_TEXTURE; i++){
		D3DXCreateTextureFromFile(pDevice, pTexture[i], &m_pTex[i]);
	}
}